"espk" = "Port d’altaveus Apple";
"ispk" = "Integrat";
"emic" = "Port de micròfon";
"imic" = "Integrat";
"hdpn" = "Port d’auriculars";
"lini" = "Port d’entrada de línia d’àudio";
"lino" = "Port de sortida de línia d’àudio";
"spdi" = "Port d’entrada digital òptica";
"spdo" = "Port de sortida digital òptica";
"pci " = "Targeta PCI";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Dispositiu de xarxa";
"blue" = "Bluetooth";
"bluh" = "Auriculars Bluetooth";
"blus" = "Microauriculars Bluetooth";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
